<?php 
	/**
	 * Подключаем файлы моделей, видов, контроллеров и маршрутизатора.
	 */
	
	/*
	 * Здесь обычно подключаются дополнительные модули, реализующие различный функционал:
	 * > аутентификацию
	 * > кеширование
	 * > работу с формами
	 * > абстракции для доступа к данным
	 * > ORM
	 * > Unit тестирование
	 * > Benchmarking
	 * > Работу с изображениями
	 * > Backup
	 * > и др.
	 */
	require_once 'core/model.php';
	require_once 'core/view.php';
	require_once 'core/controller.php';
	require_once 'core/route.php';
	/**
	 * Вызываем метод start() класса Route для запуска
	 * маршрутизатора.
	 */
	Route::start();
?>